public class Main {
    public static void main(String[] args) {

        Car car1 = new Car("Lada", "Grande", 2015, "сборка в Росиии", "жёлтый цвет кузова",
                210, 1.7f,
                "механическая коробка", "универсал", "к547ен163", 5,
                "летняя резина");
        car1.refill1();
        Car car2 = new Car("Audi", "A8 50 L TDI quattro", 2020, "сборка в Германии",
                "черный цвет кузова", 300.0, 3.0f, "автоматическая коробка",
                "седан", "н483ва777", 5, "летняя резина");
        car2.refill1();
        Car car3 = new Car("BMW", "Z8", 2021, "сборка в Германии",
                "чёрный цвет кузова", 280.0, 2.7f, "механическая коробка",
                "хэтчбек", "г372ар113", 5, "зимняя резина");
        car3.refill3();
        Car car4 = new Car("Kia", "Sportage 4 поколение", 2018, "красный цвет кузова",
                "красный цвет кузова", 260.0, 2.4f, "механическая коробка",
                "универсал", "в365вр182", 5, "зимняя резина");
        car4.refill2();
        Car car5 = new Car("Hyundai", "Avante", 2016, "сборка в Южной Корее",
                "оранжевый цвет кузова", 310.1, 1.6f, "минивэн",
                "универсал", "о256вп763", 8, "летняя резина");
        car5.refill3();

        Train train1 = new Train("Ласточка", "B-901", 2011, "Россия", "",
                301.0, 3500, 2.36, "Белорусский вокзал",
                "Минск-пассажирский", 11);
        train1.refill1();
        Train train2 = new Train("Ленинград", "D-125", 2019, "Россия", "",
                270.0, 1700, 2.36, "Ленинградский вокзал",
                "Ленинград-пассажирский", 8);
        train2.refill1();
        Bus bus1 = new Bus("Икарус", "И-53", 1997, "Беларусь", "белый", 220);
        bus1.refill1();
        Bus bus2 = new Bus("ПАЗ", "П-2", 1982, "Россия", "жёлтый", 110);
        bus2.refill2();
        Bus bus3 = new Bus("ЛиАЗ", "Л-38", 1987, "Россия", "синий", 170);
        bus3.refill2();


    }
    }
